In [1]:
url = 'postgresql://{}:{}@{}:{}/{}'
url = url.format('antoniopenta', 'London20062018','goldsmith.clb2mudtmvnt.eu-central-1.rds.amazonaws.com', '5432', 'goldsmiths')
print('URL',url)

URL postgresql://antoniopenta:London20062018@goldsmith.clb2mudtmvnt.eu-central-1.rds.amazonaws.com:5432/goldsmiths

In [2]:
%load_ext sql

In [3]:
%%sql postgresql://antoniopenta:London20062018@goldsmith.clb2mudtmvnt.eu-central-1.rds.amazonaws.com:5432/goldsmiths 
select * from composition limit 10

10 rows affected.

[('0', '11288', '132', '2 oz'),
 ('1', '11288', '222', 'Juice of 1/2'),
 ('2', '11288', '39', '1'),
 ('3', '13837', '292', '1 part'),
 ('4', '13837', '290', '5 parts'),
 ('5', '11010', '329', '1 oz'),
 ('6', '11010', '251', '1 oz'),
 ('7', '11010', '222', 'Juice of 1'),
 ('8', '11010', '222', '1'),
 ('9', '11987', '144', '1 oz')]

In [4]:
%sql select distinct stralcoholic from cocktail;

 * postgresql://antoniopenta:***@goldsmith.clb2mudtmvnt.eu-central-1.rds.amazonaws.com:5432/goldsmiths
5 rows affected.

[(None,),
 ('Alcoholic',),
 ('Optional alcohol',),
 ('Non alcoholic',),
 ('Non Alcoholic',)]

In [5]:
result = %sql select distinct stralcoholic from cocktail;
print(result)

 * postgresql://antoniopenta:***@goldsmith.clb2mudtmvnt.eu-central-1.rds.amazonaws.com:5432/goldsmiths
5 rows affected.
+------------------+
|   stralcoholic   |
+------------------+
|       None       |
|    Alcoholic     |
| Optional alcohol |
|  Non alcoholic   |
|  Non Alcoholic   |
+------------------+

In [6]:
result = %sql select distinct stralcoholic from cocktail;
print(result.keys)

 * postgresql://antoniopenta:***@goldsmith.clb2mudtmvnt.eu-central-1.rds.amazonaws.com:5432/goldsmiths
5 rows affected.
['stralcoholic']

In [7]:
result = %sql select distinct stralcoholic from cocktail;
df=result.DataFrame()
df.head()

 * postgresql://antoniopenta:***@goldsmith.clb2mudtmvnt.eu-central-1.rds.amazonaws.com:5432/goldsmiths
5 rows affected.

       stralcoholic
0              None
1         Alcoholic
2  Optional alcohol
3     Non alcoholic
4     Non Alcoholic